--
-- PostgreSQL database dump
--

SET statement_timeout = 0;
SET client_encoding = 'UTF8';
SET standard_conforming_strings = on;
SET check_function_bodies = false;
SET client_min_messages = warning;

SET search_path = public, pg_catalog;

SET default_tablespace = '';

SET default_with_oids = false;

--
-- Name: nsd; Type: TABLE; Schema: public; Owner: root; Tablespace: 
--

CREATE TABLE nsd (
    name text,
    but_id integer,
    state integer DEFAULT 0,
    in_signal integer,
    out_signal integer,
    line_id smallint,
    ko integer,
    index integer,
    ui integer,
    ui_contact integer
);


ALTER TABLE public.nsd OWNER TO root;

--
-- Data for Name: nsd; Type: TABLE DATA; Schema: public; Owner: root
--

COPY nsd (name, but_id, state, in_signal, out_signal, line_id, ko, index, ui, ui_contact) FROM stdin;
ФП2 ГШ	46	0	2	2	8	60	85	21	1
К05М 1-4 в	21	1	2	2	10	22	43	0	3
ФП1 КО	43	0	2	2	5	60	82	12	2
УПС1 з	11	0	2	2	68	12	23	18	3
К05М 9-12 н	23	1	2	2	13	24	46	1	2
К05М 5-8 в	22	1	2	2	12	23	45	0	1
ЦКО з	3	0	2	2	54	4	7	14	3
К05М 9-12 в	23	1	2	2	14	24	47	1	3
РМДИ2 з	19	4	1	2	76	20	39	20	3
К05М 17-20 в	25	1	2	2	18	26	51	2	3
кросс С з	12	0	2	2	78	13	25	21	1
К05М 37-40 н	30	1	2	2	28	31	60	4	0
К05М 25-28 в	27	1	2	2	21	28	55	3	3
УПС2 п	8	0	2	2	61	9	16	17	0
ОКС МТ з	36	0	2	2	38	37	73	7	1
К05М 29-32 н	28	1	2	2	24	29	56	3	0
ОКС ТОФМ з	10	0	2	2	66	11	21	18	1
К05М 33-36 в	29	1	2	2	25	30	59	4	3
К05М 13-16 в	24	1	2	2	16	25	49	1	1
К05М 37-40 в	30	1	2	2	27	31	61	4	1
ЯШ136 Эл. пит. з	13	0	2	2	46	14	27	12	1
KAPC CA 1 в	31	1	2	2	30	32	63	5	3
К05М 5-8 н	22	1	2	2	11	23	44	0	0
ЗШКО н	32	0	2	2	32	33	64	5	0
АРПУ в 	33	1	2	2	33	34	67	6	3
КАРС АС з	20	0	2	2	60	21	41	16	1
К05М 13-16 н	24	1	2	2	15	25	48	1	0
БП1 ГШ	41	0	2	2	3	48	80	22	0
ЯШ131 ОКС БИ п	37	1	2	2	39	38	74	8	2
ЯШ131 ОКС БИ з	37	1	2	2	40	38	75	8	3
ЯШ136-1 Эл. пит. п	38	1	2	2	41	39	76	8	0
ЯШ136-1 Эл. пит. з	38	1	2	2	42	39	77	8	1
КО ЛВС в	34	0	2	2	35	35	69	6	1
РМИШ з	35	4	1	2	44	36	71	7	3
УПС1 п	11	0	2	2	67	12	22	18	2
ФП2 КО	44	0	2	2	6	60	83	12	3
КАРС АС п	20	0	2	2	59	21	40	16	0
К05М 29-32 в	28	1	2	2	23	29	57	3	1
РМО2 з	15	0	2	2	72	16	31	19	3
К05М 17-20 н	25	1	2	2	17	26	50	2	2
РМДИ2 п	19	0	2	2	75	20	38	20	2
ОКС МТ п	36	0	1	2	37	37	72	7	0
РМИШ п	35	0	1	2	43	36	70	7	2
БП2 ГШ	42	0	2	1	4	48	81	22	1
КО ЛВС н	34	0	2	2	36	35	68	6	0
АРПУ н	33	0	2	2	34	34	66	6	2
ФП1 ГШ	45	0	2	2	7	60	84	21	0
АКО п	1	0	2	2	49	2	2	13	1
РМДИ1 п	18	0	2	2	73	19	36	20	0
РМО1 з	14	0	2	2	70	15	29	19	1
ЦУУ2 з	5	0	2	2	58	6	11	15	3
К05М 21-24 н	26	1	2	2	20	27	52	2	0
кросс НС,Ц з	6	0	2	2	80	7	13	23	1
К05М 25-28 н	27	1	2	2	22	28	54	3	2
ЯШ096-1 ГШ з	7	0	2	2	82	8	15	23	3
К05М 21-24 в	26	1	2	2	19	27	53	2	1
ОКС ТОФМ п 	10	0	2	2	65	11	20	18	0
К05М 33-36 н	29	1	2	2	26	30	58	4	2
УПС3 з	9	0	2	2	64	10	19	17	3
К05М 1-4 н	21	1	2	2	9	22	42	0	2
ЗШКО в 	32	0	2	2	31	33	65	5	1
РМО2 п	15	0	2	2	71	16	30	19	2
KAPC CA 2 н	31	1	2	2	29	32	62	5	2
РМДИ1 з	18	0	2	2	74	19	37	20	1
кросс НС,Ц п	6	0	2	2	79	7	12	23	0
АКО з	1	0	2	2	50	2	3	13	1
ПА616 1	39	0	2	2	1	48	78	13	2
П616 з	0	0	2	2	48	1	1	13	0
ЦКО п	3	0	2	2	53	4	6	14	2
ЦУУ1 п	4	0	2	2	55	5	8	15	0
П616 п	0	0	2	2	47	1	0	13	0
УПС2 з	8	0	2	2	62	9	17	17	1
УПС3 п	9	0	2	2	63	10	18	17	2
СА508 ОКС БИ п	2	0	2	2	51	3	4	14	0
ЦУУ1 з	4	0	1	2	56	5	9	15	1
ЦУУ2 п	5	0	2	2	57	6	10	15	2
СА508 ОКС БИ з	2	0	2	2	52	3	5	14	1
РМО1 п	14	0	2	2	69	15	28	19	0
ПА616 2	40	0	2	2	2	48	79	13	3
кросс С п	12	0	2	2	77	13	24	21	0
ЯШ096-1 ГШ п	7	0	2	2	81	8	14	23	2
РМО3 п	16	6	1	2	-1	17	32	-1	-1
РМО3 з	16	6	1	2	-1	17	33	-1	-1
РМО4 п	17	6	1	2	-1	18	34	-1	-1
РМО4 з	17	6	1	2	-1	18	35	-1	-1
ЯШ136 Эл. пит. п	13	0	2	2	45	14	26	12	0
\.


--
-- Name: change_nsd; Type: TRIGGER; Schema: public; Owner: root
--

CREATE TRIGGER change_nsd AFTER INSERT OR DELETE OR UPDATE ON nsd FOR EACH ROW EXECUTE PROCEDURE nsd_trigger();


--
-- PostgreSQL database dump complete
--

